grevaillot/svd_tools/headers/ATSAMR34J16B/evsys.h
#pragma once 

/* --- EVSYS: Event System Interface -------------------------------- */

/** @defgroup evsys_registers Event System Interface Register
@{*/

/** EVSYS_CTRLA Control **/
#define EVSYS_CTRLA			MMIO32(EVSYS_BASE + 0x00)
/** EVSYS_CHSTATUS Channel Status **/
#define EVSYS_CHSTATUS			MMIO32(EVSYS_BASE + 0x0c)
/** EVSYS_INTENCLR Interrupt Enable Clear **/
#define EVSYS_INTENCLR			MMIO32(EVSYS_BASE + 0x10)
/** EVSYS_INTENSET Interrupt Enable Set **/
#define EVSYS_INTENSET			MMIO32(EVSYS_BASE + 0x14)
/** EVSYS_INTFLAG Interrupt Flag Status and Clear **/
#define EVSYS_INTFLAG			MMIO32(EVSYS_BASE + 0x18)
/** EVSYS_SWEVT Software Event **/
#define EVSYS_SWEVT			MMIO32(EVSYS_BASE + 0x1c)
/** EVSYS_CHANNEL0 Channel n **/
#define EVSYS_CHANNEL0			MMIO32(EVSYS_BASE + 0x20)
/** EVSYS_CHANNEL1 Channel n **/
#define EVSYS_CHANNEL1			MMIO32(EVSYS_BASE + 0x24)
/** EVSYS_CHANNEL2 Channel n **/
#define EVSYS_CHANNEL2			MMIO32(EVSYS_BASE + 0x28)
/** EVSYS_CHANNEL3 Channel n **/
#define EVSYS_CHANNEL3			MMIO32(EVSYS_BASE + 0x2c)
/** EVSYS_CHANNEL4 Channel n **/
#define EVSYS_CHANNEL4			MMIO32(EVSYS_BASE + 0x30)
/** EVSYS_CHANNEL5 Channel n **/
#define EVSYS_CHANNEL5			MMIO32(EVSYS_BASE + 0x34)
/** EVSYS_CHANNEL6 Channel n **/
#define EVSYS_CHANNEL6			MMIO32(EVSYS_BASE + 0x38)
/** EVSYS_CHANNEL7 Channel n **/
#define EVSYS_CHANNEL7			MMIO32(EVSYS_BASE + 0x3c)
/** EVSYS_CHANNEL8 Channel n **/
#define EVSYS_CHANNEL8			MMIO32(EVSYS_BASE + 0x40)
/** EVSYS_CHANNEL9 Channel n **/
#define EVSYS_CHANNEL9			MMIO32(EVSYS_BASE + 0x44)
/** EVSYS_CHANNEL10 Channel n **/
#define EVSYS_CHANNEL10			MMIO32(EVSYS_BASE + 0x48)
/** EVSYS_CHANNEL11 Channel n **/
#define EVSYS_CHANNEL11			MMIO32(EVSYS_BASE + 0x4c)
/** EVSYS_USER0 User Multiplexer n **/
#define EVSYS_USER0			MMIO32(EVSYS_BASE + 0x80)
/** EVSYS_USER1 User Multiplexer n **/
#define EVSYS_USER1			MMIO32(EVSYS_BASE + 0x84)
/** EVSYS_USER2 User Multiplexer n **/
#define EVSYS_USER2			MMIO32(EVSYS_BASE + 0x88)
/** EVSYS_USER3 User Multiplexer n **/
#define EVSYS_USER3			MMIO32(EVSYS_BASE + 0x8c)
/** EVSYS_USER4 User Multiplexer n **/
#define EVSYS_USER4			MMIO32(EVSYS_BASE + 0x90)
/** EVSYS_USER5 User Multiplexer n **/
#define EVSYS_USER5			MMIO32(EVSYS_BASE + 0x94)
/** EVSYS_USER6 User Multiplexer n **/
#define EVSYS_USER6			MMIO32(EVSYS_BASE + 0x98)
/** EVSYS_USER7 User Multiplexer n **/
#define EVSYS_USER7			MMIO32(EVSYS_BASE + 0x9c)
/** EVSYS_USER8 User Multiplexer n **/
#define EVSYS_USER8			MMIO32(EVSYS_BASE + 0xa0)
/** EVSYS_USER9 User Multiplexer n **/
#define EVSYS_USER9			MMIO32(EVSYS_BASE + 0xa4)
/** EVSYS_USER10 User Multiplexer n **/
#define EVSYS_USER10			MMIO32(EVSYS_BASE + 0xa8)
/** EVSYS_USER11 User Multiplexer n **/
#define EVSYS_USER11			MMIO32(EVSYS_BASE + 0xac)
/** EVSYS_USER12 User Multiplexer n **/
#define EVSYS_USER12			MMIO32(EVSYS_BASE + 0xb0)
/** EVSYS_USER13 User Multiplexer n **/
#define EVSYS_USER13			MMIO32(EVSYS_BASE + 0xb4)
/** EVSYS_USER14 User Multiplexer n **/
#define EVSYS_USER14			MMIO32(EVSYS_BASE + 0xb8)
/** EVSYS_USER15 User Multiplexer n **/
#define EVSYS_USER15			MMIO32(EVSYS_BASE + 0xbc)
/** EVSYS_USER16 User Multiplexer n **/
#define EVSYS_USER16			MMIO32(EVSYS_BASE + 0xc0)
/** EVSYS_USER17 User Multiplexer n **/
#define EVSYS_USER17			MMIO32(EVSYS_BASE + 0xc4)
/** EVSYS_USER18 User Multiplexer n **/
#define EVSYS_USER18			MMIO32(EVSYS_BASE + 0xc8)
/** EVSYS_USER19 User Multiplexer n **/
#define EVSYS_USER19			MMIO32(EVSYS_BASE + 0xcc)
/** EVSYS_USER20 User Multiplexer n **/
#define EVSYS_USER20			MMIO32(EVSYS_BASE + 0xd0)
/** EVSYS_USER21 User Multiplexer n **/
#define EVSYS_USER21			MMIO32(EVSYS_BASE + 0xd4)
/** EVSYS_USER22 User Multiplexer n **/
#define EVSYS_USER22			MMIO32(EVSYS_BASE + 0xd8)
/** EVSYS_USER23 User Multiplexer n **/
#define EVSYS_USER23			MMIO32(EVSYS_BASE + 0xdc)
/** EVSYS_USER24 User Multiplexer n **/
#define EVSYS_USER24			MMIO32(EVSYS_BASE + 0xe0)
/** EVSYS_USER25 User Multiplexer n **/
#define EVSYS_USER25			MMIO32(EVSYS_BASE + 0xe4)
/** EVSYS_USER26 User Multiplexer n **/
#define EVSYS_USER26			MMIO32(EVSYS_BASE + 0xe8)
/** EVSYS_USER27 User Multiplexer n **/
#define EVSYS_USER27			MMIO32(EVSYS_BASE + 0xec)
/** EVSYS_USER28 User Multiplexer n **/
#define EVSYS_USER28			MMIO32(EVSYS_BASE + 0xf0)
/** EVSYS_USER29 User Multiplexer n **/
#define EVSYS_USER29			MMIO32(EVSYS_BASE + 0xf4)
/** EVSYS_USER30 User Multiplexer n **/
#define EVSYS_USER30			MMIO32(EVSYS_BASE + 0xf8)
/** EVSYS_USER31 User Multiplexer n **/
#define EVSYS_USER31			MMIO32(EVSYS_BASE + 0xfc)
/** EVSYS_USER32 User Multiplexer n **/
#define EVSYS_USER32			MMIO32(EVSYS_BASE + 0x100)
/** EVSYS_USER33 User Multiplexer n **/
#define EVSYS_USER33			MMIO32(EVSYS_BASE + 0x104)
/** EVSYS_USER34 User Multiplexer n **/
#define EVSYS_USER34			MMIO32(EVSYS_BASE + 0x108)
/** EVSYS_USER35 User Multiplexer n **/
#define EVSYS_USER35			MMIO32(EVSYS_BASE + 0x10c)
/** EVSYS_USER36 User Multiplexer n **/
#define EVSYS_USER36			MMIO32(EVSYS_BASE + 0x110)
/** EVSYS_USER37 User Multiplexer n **/
#define EVSYS_USER37			MMIO32(EVSYS_BASE + 0x114)
/** EVSYS_USER38 User Multiplexer n **/
#define EVSYS_USER38			MMIO32(EVSYS_BASE + 0x118)
/** EVSYS_USER39 User Multiplexer n **/
#define EVSYS_USER39			MMIO32(EVSYS_BASE + 0x11c)
/** EVSYS_USER40 User Multiplexer n **/
#define EVSYS_USER40			MMIO32(EVSYS_BASE + 0x120)
/** EVSYS_USER41 User Multiplexer n **/
#define EVSYS_USER41			MMIO32(EVSYS_BASE + 0x124)
/** EVSYS_USER42 User Multiplexer n **/
#define EVSYS_USER42			MMIO32(EVSYS_BASE + 0x128)
/** EVSYS_USER43 User Multiplexer n **/
#define EVSYS_USER43			MMIO32(EVSYS_BASE + 0x12c)
/** EVSYS_USER44 User Multiplexer n **/
#define EVSYS_USER44			MMIO32(EVSYS_BASE + 0x130)

/**@}*/


/** @defgroup evsys_ctrla CTRLA Control
@{*/

/** EVSYS_CTRLA_SWRST Software Reset **/
#define EVSYS_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup evsys_chstatus CHSTATUS Channel Status
@{*/

/** EVSYS_CHSTATUS_CHBUSY11 Channel 11 Busy **/
#define EVSYS_CHSTATUS_CHBUSY11		(1 << 27)
/** EVSYS_CHSTATUS_CHBUSY10 Channel 10 Busy **/
#define EVSYS_CHSTATUS_CHBUSY10		(1 << 26)
/** EVSYS_CHSTATUS_CHBUSY9 Channel 9 Busy **/
#define EVSYS_CHSTATUS_CHBUSY9		(1 << 25)
/** EVSYS_CHSTATUS_CHBUSY8 Channel 8 Busy **/
#define EVSYS_CHSTATUS_CHBUSY8		(1 << 24)
/** EVSYS_CHSTATUS_CHBUSY7 Channel 7 Busy **/
#define EVSYS_CHSTATUS_CHBUSY7		(1 << 23)
/** EVSYS_CHSTATUS_CHBUSY6 Channel 6 Busy **/
#define EVSYS_CHSTATUS_CHBUSY6		(1 << 22)
/** EVSYS_CHSTATUS_CHBUSY5 Channel 5 Busy **/
#define EVSYS_CHSTATUS_CHBUSY5		(1 << 21)
/** EVSYS_CHSTATUS_CHBUSY4 Channel 4 Busy **/
#define EVSYS_CHSTATUS_CHBUSY4		(1 << 20)
/** EVSYS_CHSTATUS_CHBUSY3 Channel 3 Busy **/
#define EVSYS_CHSTATUS_CHBUSY3		(1 << 19)
/** EVSYS_CHSTATUS_CHBUSY2 Channel 2 Busy **/
#define EVSYS_CHSTATUS_CHBUSY2		(1 << 18)
/** EVSYS_CHSTATUS_CHBUSY1 Channel 1 Busy **/
#define EVSYS_CHSTATUS_CHBUSY1		(1 << 17)
/** EVSYS_CHSTATUS_CHBUSY0 Channel 0 Busy **/
#define EVSYS_CHSTATUS_CHBUSY0		(1 << 16)
/** EVSYS_CHSTATUS_USRRDY11 Channel 11 User Ready **/
#define EVSYS_CHSTATUS_USRRDY11		(1 << 11)
/** EVSYS_CHSTATUS_USRRDY10 Channel 10 User Ready **/
#define EVSYS_CHSTATUS_USRRDY10		(1 << 10)
/** EVSYS_CHSTATUS_USRRDY9 Channel 9 User Ready **/
#define EVSYS_CHSTATUS_USRRDY9		(1 << 9)
/** EVSYS_CHSTATUS_USRRDY8 Channel 8 User Ready **/
#define EVSYS_CHSTATUS_USRRDY8		(1 << 8)
/** EVSYS_CHSTATUS_USRRDY7 Channel 7 User Ready **/
#define EVSYS_CHSTATUS_USRRDY7		(1 << 7)
/** EVSYS_CHSTATUS_USRRDY6 Channel 6 User Ready **/
#define EVSYS_CHSTATUS_USRRDY6		(1 << 6)
/** EVSYS_CHSTATUS_USRRDY5 Channel 5 User Ready **/
#define EVSYS_CHSTATUS_USRRDY5		(1 << 5)
/** EVSYS_CHSTATUS_USRRDY4 Channel 4 User Ready **/
#define EVSYS_CHSTATUS_USRRDY4		(1 << 4)
/** EVSYS_CHSTATUS_USRRDY3 Channel 3 User Ready **/
#define EVSYS_CHSTATUS_USRRDY3		(1 << 3)
/** EVSYS_CHSTATUS_USRRDY2 Channel 2 User Ready **/
#define EVSYS_CHSTATUS_USRRDY2		(1 << 2)
/** EVSYS_CHSTATUS_USRRDY1 Channel 1 User Ready **/
#define EVSYS_CHSTATUS_USRRDY1		(1 << 1)
/** EVSYS_CHSTATUS_USRRDY0 Channel 0 User Ready **/
#define EVSYS_CHSTATUS_USRRDY0		(1 << 0)

/**@}*/

/** @defgroup evsys_intenclr INTENCLR Interrupt Enable Clear
@{*/

/** EVSYS_INTENCLR_EVD11 Channel 11 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD11		(1 << 27)
/** EVSYS_INTENCLR_EVD10 Channel 10 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD10		(1 << 26)
/** EVSYS_INTENCLR_EVD9 Channel 9 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD9		(1 << 25)
/** EVSYS_INTENCLR_EVD8 Channel 8 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD8		(1 << 24)
/** EVSYS_INTENCLR_EVD7 Channel 7 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD7		(1 << 23)
/** EVSYS_INTENCLR_EVD6 Channel 6 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD6		(1 << 22)
/** EVSYS_INTENCLR_EVD5 Channel 5 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD5		(1 << 21)
/** EVSYS_INTENCLR_EVD4 Channel 4 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD4		(1 << 20)
/** EVSYS_INTENCLR_EVD3 Channel 3 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD3		(1 << 19)
/** EVSYS_INTENCLR_EVD2 Channel 2 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD2		(1 << 18)
/** EVSYS_INTENCLR_EVD1 Channel 1 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD1		(1 << 17)
/** EVSYS_INTENCLR_EVD0 Channel 0 Event Detection Interrupt Enable **/
#define EVSYS_INTENCLR_EVD0		(1 << 16)
/** EVSYS_INTENCLR_OVR11 Channel 11 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR11		(1 << 11)
/** EVSYS_INTENCLR_OVR10 Channel 10 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR10		(1 << 10)
/** EVSYS_INTENCLR_OVR9 Channel 9 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR9		(1 << 9)
/** EVSYS_INTENCLR_OVR8 Channel 8 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR8		(1 << 8)
/** EVSYS_INTENCLR_OVR7 Channel 7 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR7		(1 << 7)
/** EVSYS_INTENCLR_OVR6 Channel 6 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR6		(1 << 6)
/** EVSYS_INTENCLR_OVR5 Channel 5 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR5		(1 << 5)
/** EVSYS_INTENCLR_OVR4 Channel 4 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR4		(1 << 4)
/** EVSYS_INTENCLR_OVR3 Channel 3 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR3		(1 << 3)
/** EVSYS_INTENCLR_OVR2 Channel 2 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR2		(1 << 2)
/** EVSYS_INTENCLR_OVR1 Channel 1 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR1		(1 << 1)
/** EVSYS_INTENCLR_OVR0 Channel 0 Overrun Interrupt Enable **/
#define EVSYS_INTENCLR_OVR0		(1 << 0)

/**@}*/

/** @defgroup evsys_intenset INTENSET Interrupt Enable Set
@{*/

