grevaillot/svd_tools/headers/ATSAMR34J16B/evsys.h
/** EVSYS_INTENSET_EVD11 Channel 11 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD11		(1 << 27)
/** EVSYS_INTENSET_EVD10 Channel 10 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD10		(1 << 26)
/** EVSYS_INTENSET_EVD9 Channel 9 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD9		(1 << 25)
/** EVSYS_INTENSET_EVD8 Channel 8 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD8		(1 << 24)
/** EVSYS_INTENSET_EVD7 Channel 7 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD7		(1 << 23)
/** EVSYS_INTENSET_EVD6 Channel 6 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD6		(1 << 22)
/** EVSYS_INTENSET_EVD5 Channel 5 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD5		(1 << 21)
/** EVSYS_INTENSET_EVD4 Channel 4 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD4		(1 << 20)
/** EVSYS_INTENSET_EVD3 Channel 3 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD3		(1 << 19)
/** EVSYS_INTENSET_EVD2 Channel 2 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD2		(1 << 18)
/** EVSYS_INTENSET_EVD1 Channel 1 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD1		(1 << 17)
/** EVSYS_INTENSET_EVD0 Channel 0 Event Detection Interrupt Enable **/
#define EVSYS_INTENSET_EVD0		(1 << 16)
/** EVSYS_INTENSET_OVR11 Channel 11 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR11		(1 << 11)
/** EVSYS_INTENSET_OVR10 Channel 10 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR10		(1 << 10)
/** EVSYS_INTENSET_OVR9 Channel 9 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR9		(1 << 9)
/** EVSYS_INTENSET_OVR8 Channel 8 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR8		(1 << 8)
/** EVSYS_INTENSET_OVR7 Channel 7 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR7		(1 << 7)
/** EVSYS_INTENSET_OVR6 Channel 6 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR6		(1 << 6)
/** EVSYS_INTENSET_OVR5 Channel 5 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR5		(1 << 5)
/** EVSYS_INTENSET_OVR4 Channel 4 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR4		(1 << 4)
/** EVSYS_INTENSET_OVR3 Channel 3 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR3		(1 << 3)
/** EVSYS_INTENSET_OVR2 Channel 2 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR2		(1 << 2)
/** EVSYS_INTENSET_OVR1 Channel 1 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR1		(1 << 1)
/** EVSYS_INTENSET_OVR0 Channel 0 Overrun Interrupt Enable **/
#define EVSYS_INTENSET_OVR0		(1 << 0)

/**@}*/

/** @defgroup evsys_intflag INTFLAG Interrupt Flag Status and Clear
@{*/

/** EVSYS_INTFLAG_EVD11 Channel 11 Event Detection **/
#define EVSYS_INTFLAG_EVD11		(1 << 27)
/** EVSYS_INTFLAG_EVD10 Channel 10 Event Detection **/
#define EVSYS_INTFLAG_EVD10		(1 << 26)
/** EVSYS_INTFLAG_EVD9 Channel 9 Event Detection **/
#define EVSYS_INTFLAG_EVD9		(1 << 25)
/** EVSYS_INTFLAG_EVD8 Channel 8 Event Detection **/
#define EVSYS_INTFLAG_EVD8		(1 << 24)
/** EVSYS_INTFLAG_EVD7 Channel 7 Event Detection **/
#define EVSYS_INTFLAG_EVD7		(1 << 23)
/** EVSYS_INTFLAG_EVD6 Channel 6 Event Detection **/
#define EVSYS_INTFLAG_EVD6		(1 << 22)
/** EVSYS_INTFLAG_EVD5 Channel 5 Event Detection **/
#define EVSYS_INTFLAG_EVD5		(1 << 21)
/** EVSYS_INTFLAG_EVD4 Channel 4 Event Detection **/
#define EVSYS_INTFLAG_EVD4		(1 << 20)
/** EVSYS_INTFLAG_EVD3 Channel 3 Event Detection **/
#define EVSYS_INTFLAG_EVD3		(1 << 19)
/** EVSYS_INTFLAG_EVD2 Channel 2 Event Detection **/
#define EVSYS_INTFLAG_EVD2		(1 << 18)
/** EVSYS_INTFLAG_EVD1 Channel 1 Event Detection **/
#define EVSYS_INTFLAG_EVD1		(1 << 17)
/** EVSYS_INTFLAG_EVD0 Channel 0 Event Detection **/
#define EVSYS_INTFLAG_EVD0		(1 << 16)
/** EVSYS_INTFLAG_OVR11 Channel 11 Overrun **/
#define EVSYS_INTFLAG_OVR11		(1 << 11)
/** EVSYS_INTFLAG_OVR10 Channel 10 Overrun **/
#define EVSYS_INTFLAG_OVR10		(1 << 10)
/** EVSYS_INTFLAG_OVR9 Channel 9 Overrun **/
#define EVSYS_INTFLAG_OVR9		(1 << 9)
/** EVSYS_INTFLAG_OVR8 Channel 8 Overrun **/
#define EVSYS_INTFLAG_OVR8		(1 << 8)
/** EVSYS_INTFLAG_OVR7 Channel 7 Overrun **/
#define EVSYS_INTFLAG_OVR7		(1 << 7)
/** EVSYS_INTFLAG_OVR6 Channel 6 Overrun **/
#define EVSYS_INTFLAG_OVR6		(1 << 6)
/** EVSYS_INTFLAG_OVR5 Channel 5 Overrun **/
#define EVSYS_INTFLAG_OVR5		(1 << 5)
/** EVSYS_INTFLAG_OVR4 Channel 4 Overrun **/
#define EVSYS_INTFLAG_OVR4		(1 << 4)
/** EVSYS_INTFLAG_OVR3 Channel 3 Overrun **/
#define EVSYS_INTFLAG_OVR3		(1 << 3)
/** EVSYS_INTFLAG_OVR2 Channel 2 Overrun **/
#define EVSYS_INTFLAG_OVR2		(1 << 2)
/** EVSYS_INTFLAG_OVR1 Channel 1 Overrun **/
#define EVSYS_INTFLAG_OVR1		(1 << 1)
/** EVSYS_INTFLAG_OVR0 Channel 0 Overrun **/
#define EVSYS_INTFLAG_OVR0		(1 << 0)

/**@}*/

/** @defgroup evsys_swevt SWEVT Software Event
@{*/

/** EVSYS_SWEVT_CHANNEL11 Channel 11 Software Selection **/
#define EVSYS_SWEVT_CHANNEL11		(1 << 11)
/** EVSYS_SWEVT_CHANNEL10 Channel 10 Software Selection **/
#define EVSYS_SWEVT_CHANNEL10		(1 << 10)
/** EVSYS_SWEVT_CHANNEL9 Channel 9 Software Selection **/
#define EVSYS_SWEVT_CHANNEL9		(1 << 9)
/** EVSYS_SWEVT_CHANNEL8 Channel 8 Software Selection **/
#define EVSYS_SWEVT_CHANNEL8		(1 << 8)
/** EVSYS_SWEVT_CHANNEL7 Channel 7 Software Selection **/
#define EVSYS_SWEVT_CHANNEL7		(1 << 7)
/** EVSYS_SWEVT_CHANNEL6 Channel 6 Software Selection **/
#define EVSYS_SWEVT_CHANNEL6		(1 << 6)
/** EVSYS_SWEVT_CHANNEL5 Channel 5 Software Selection **/
#define EVSYS_SWEVT_CHANNEL5		(1 << 5)
/** EVSYS_SWEVT_CHANNEL4 Channel 4 Software Selection **/
#define EVSYS_SWEVT_CHANNEL4		(1 << 4)
/** EVSYS_SWEVT_CHANNEL3 Channel 3 Software Selection **/
#define EVSYS_SWEVT_CHANNEL3		(1 << 3)
/** EVSYS_SWEVT_CHANNEL2 Channel 2 Software Selection **/
#define EVSYS_SWEVT_CHANNEL2		(1 << 2)
/** EVSYS_SWEVT_CHANNEL1 Channel 1 Software Selection **/
#define EVSYS_SWEVT_CHANNEL1		(1 << 1)
/** EVSYS_SWEVT_CHANNEL0 Channel 0 Software Selection **/
#define EVSYS_SWEVT_CHANNEL0		(1 << 0)

/**@}*/

/** @defgroup evsys_channel0 CHANNEL0 Channel n
@{*/

