grevaillot/svd_tools/headers/ATSAMR34J16B/evsys.h
/** EVSYS_CHANNEL0_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL0_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL0_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL0_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL0_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL0_EDGSEL_MASK		0x03
/** @defgroup evsys_channel0_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL0_PATH_SHIFT		8
#define EVSYS_CHANNEL0_PATH_MASK		0x03
/** @defgroup evsys_channel0_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL0_EVGEN_SHIFT		0
#define EVSYS_CHANNEL0_EVGEN_MASK		0x7f
/** @defgroup evsys_channel0_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel1 CHANNEL1 Channel n
@{*/

/** EVSYS_CHANNEL1_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL1_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL1_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL1_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL1_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL1_EDGSEL_MASK		0x03
/** @defgroup evsys_channel1_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL1_PATH_SHIFT		8
#define EVSYS_CHANNEL1_PATH_MASK		0x03
/** @defgroup evsys_channel1_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL1_EVGEN_SHIFT		0
#define EVSYS_CHANNEL1_EVGEN_MASK		0x7f
/** @defgroup evsys_channel1_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel2 CHANNEL2 Channel n
@{*/

/** EVSYS_CHANNEL2_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL2_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL2_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL2_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL2_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL2_EDGSEL_MASK		0x03
/** @defgroup evsys_channel2_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL2_PATH_SHIFT		8
#define EVSYS_CHANNEL2_PATH_MASK		0x03
/** @defgroup evsys_channel2_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL2_EVGEN_SHIFT		0
#define EVSYS_CHANNEL2_EVGEN_MASK		0x7f
/** @defgroup evsys_channel2_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel3 CHANNEL3 Channel n
@{*/

/** EVSYS_CHANNEL3_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL3_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL3_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL3_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL3_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL3_EDGSEL_MASK		0x03
/** @defgroup evsys_channel3_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL3_PATH_SHIFT		8
#define EVSYS_CHANNEL3_PATH_MASK		0x03
/** @defgroup evsys_channel3_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL3_EVGEN_SHIFT		0
#define EVSYS_CHANNEL3_EVGEN_MASK		0x7f
/** @defgroup evsys_channel3_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel4 CHANNEL4 Channel n
@{*/

/** EVSYS_CHANNEL4_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL4_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL4_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL4_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL4_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL4_EDGSEL_MASK		0x03
/** @defgroup evsys_channel4_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL4_PATH_SHIFT		8
#define EVSYS_CHANNEL4_PATH_MASK		0x03
/** @defgroup evsys_channel4_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL4_EVGEN_SHIFT		0
#define EVSYS_CHANNEL4_EVGEN_MASK		0x7f
/** @defgroup evsys_channel4_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel5 CHANNEL5 Channel n
@{*/

/** EVSYS_CHANNEL5_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL5_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL5_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL5_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL5_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL5_EDGSEL_MASK		0x03
/** @defgroup evsys_channel5_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL5_PATH_SHIFT		8
#define EVSYS_CHANNEL5_PATH_MASK		0x03
/** @defgroup evsys_channel5_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL5_EVGEN_SHIFT		0
#define EVSYS_CHANNEL5_EVGEN_MASK		0x7f
/** @defgroup evsys_channel5_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel6 CHANNEL6 Channel n
@{*/

/** EVSYS_CHANNEL6_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL6_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL6_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL6_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL6_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL6_EDGSEL_MASK		0x03
/** @defgroup evsys_channel6_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL6_PATH_SHIFT		8
#define EVSYS_CHANNEL6_PATH_MASK		0x03
/** @defgroup evsys_channel6_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL6_EVGEN_SHIFT		0
#define EVSYS_CHANNEL6_EVGEN_MASK		0x7f
/** @defgroup evsys_channel6_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel7 CHANNEL7 Channel n
@{*/

/** EVSYS_CHANNEL7_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL7_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL7_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL7_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL7_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL7_EDGSEL_MASK		0x03
/** @defgroup evsys_channel7_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL7_PATH_SHIFT		8
#define EVSYS_CHANNEL7_PATH_MASK		0x03
/** @defgroup evsys_channel7_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL7_EVGEN_SHIFT		0
#define EVSYS_CHANNEL7_EVGEN_MASK		0x7f
/** @defgroup evsys_channel7_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel8 CHANNEL8 Channel n
@{*/

/** EVSYS_CHANNEL8_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL8_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL8_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL8_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL8_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL8_EDGSEL_MASK		0x03
/** @defgroup evsys_channel8_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL8_PATH_SHIFT		8
#define EVSYS_CHANNEL8_PATH_MASK		0x03
/** @defgroup evsys_channel8_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL8_EVGEN_SHIFT		0
#define EVSYS_CHANNEL8_EVGEN_MASK		0x7f
/** @defgroup evsys_channel8_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel9 CHANNEL9 Channel n
@{*/

