grevaillot/svd_tools/headers/ATSAMR34J16B/evsys.h
/** EVSYS_CHANNEL9_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL9_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL9_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL9_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL9_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL9_EDGSEL_MASK		0x03
/** @defgroup evsys_channel9_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL9_PATH_SHIFT		8
#define EVSYS_CHANNEL9_PATH_MASK		0x03
/** @defgroup evsys_channel9_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL9_EVGEN_SHIFT		0
#define EVSYS_CHANNEL9_EVGEN_MASK		0x7f
/** @defgroup evsys_channel9_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel10 CHANNEL10 Channel n
@{*/

/** EVSYS_CHANNEL10_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL10_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL10_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL10_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL10_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL10_EDGSEL_MASK		0x03
/** @defgroup evsys_channel10_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL10_PATH_SHIFT		8
#define EVSYS_CHANNEL10_PATH_MASK		0x03
/** @defgroup evsys_channel10_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL10_EVGEN_SHIFT		0
#define EVSYS_CHANNEL10_EVGEN_MASK		0x7f
/** @defgroup evsys_channel10_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_channel11 CHANNEL11 Channel n
@{*/

/** EVSYS_CHANNEL11_ONDEMAND Generic Clock On Demand **/
#define EVSYS_CHANNEL11_ONDEMAND		(1 << 15)
/** EVSYS_CHANNEL11_RUNSTDBY Run in standby **/
#define EVSYS_CHANNEL11_RUNSTDBY		(1 << 14)

#define EVSYS_CHANNEL11_EDGSEL_SHIFT		10
#define EVSYS_CHANNEL11_EDGSEL_MASK		0x03
/** @defgroup evsys_channel11_edgsel EDGSEL Edge Detection Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL11_PATH_SHIFT		8
#define EVSYS_CHANNEL11_PATH_MASK		0x03
/** @defgroup evsys_channel11_path PATH Path Selection
@{*/
/**@}*/


#define EVSYS_CHANNEL11_EVGEN_SHIFT		0
#define EVSYS_CHANNEL11_EVGEN_MASK		0x7f
/** @defgroup evsys_channel11_evgen EVGEN Event Generator Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user0 USER0 User Multiplexer n
@{*/


#define EVSYS_USER0_CHANNEL_SHIFT		0
#define EVSYS_USER0_CHANNEL_MASK		0x1f
/** @defgroup evsys_user0_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user1 USER1 User Multiplexer n
@{*/


#define EVSYS_USER1_CHANNEL_SHIFT		0
#define EVSYS_USER1_CHANNEL_MASK		0x1f
/** @defgroup evsys_user1_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user2 USER2 User Multiplexer n
@{*/


#define EVSYS_USER2_CHANNEL_SHIFT		0
#define EVSYS_USER2_CHANNEL_MASK		0x1f
/** @defgroup evsys_user2_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user3 USER3 User Multiplexer n
@{*/


#define EVSYS_USER3_CHANNEL_SHIFT		0
#define EVSYS_USER3_CHANNEL_MASK		0x1f
/** @defgroup evsys_user3_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user4 USER4 User Multiplexer n
@{*/


#define EVSYS_USER4_CHANNEL_SHIFT		0
#define EVSYS_USER4_CHANNEL_MASK		0x1f
/** @defgroup evsys_user4_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user5 USER5 User Multiplexer n
@{*/


#define EVSYS_USER5_CHANNEL_SHIFT		0
#define EVSYS_USER5_CHANNEL_MASK		0x1f
/** @defgroup evsys_user5_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user6 USER6 User Multiplexer n
@{*/


#define EVSYS_USER6_CHANNEL_SHIFT		0
#define EVSYS_USER6_CHANNEL_MASK		0x1f
/** @defgroup evsys_user6_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user7 USER7 User Multiplexer n
@{*/


#define EVSYS_USER7_CHANNEL_SHIFT		0
#define EVSYS_USER7_CHANNEL_MASK		0x1f
/** @defgroup evsys_user7_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user8 USER8 User Multiplexer n
@{*/


#define EVSYS_USER8_CHANNEL_SHIFT		0
#define EVSYS_USER8_CHANNEL_MASK		0x1f
/** @defgroup evsys_user8_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user9 USER9 User Multiplexer n
@{*/


#define EVSYS_USER9_CHANNEL_SHIFT		0
#define EVSYS_USER9_CHANNEL_MASK		0x1f
/** @defgroup evsys_user9_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user10 USER10 User Multiplexer n
@{*/


#define EVSYS_USER10_CHANNEL_SHIFT		0
#define EVSYS_USER10_CHANNEL_MASK		0x1f
/** @defgroup evsys_user10_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user11 USER11 User Multiplexer n
@{*/


#define EVSYS_USER11_CHANNEL_SHIFT		0
#define EVSYS_USER11_CHANNEL_MASK		0x1f
/** @defgroup evsys_user11_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user12 USER12 User Multiplexer n
@{*/


#define EVSYS_USER12_CHANNEL_SHIFT		0
#define EVSYS_USER12_CHANNEL_MASK		0x1f
/** @defgroup evsys_user12_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user13 USER13 User Multiplexer n
@{*/


#define EVSYS_USER13_CHANNEL_SHIFT		0
#define EVSYS_USER13_CHANNEL_MASK		0x1f
/** @defgroup evsys_user13_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user14 USER14 User Multiplexer n
@{*/


#define EVSYS_USER14_CHANNEL_SHIFT		0
#define EVSYS_USER14_CHANNEL_MASK		0x1f
/** @defgroup evsys_user14_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user15 USER15 User Multiplexer n
@{*/


#define EVSYS_USER15_CHANNEL_SHIFT		0
#define EVSYS_USER15_CHANNEL_MASK		0x1f
/** @defgroup evsys_user15_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user16 USER16 User Multiplexer n
@{*/


#define EVSYS_USER16_CHANNEL_SHIFT		0
#define EVSYS_USER16_CHANNEL_MASK		0x1f
/** @defgroup evsys_user16_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user17 USER17 User Multiplexer n
@{*/


