grevaillot/svd_tools/headers/ATSAMR34J16B/evsys.h
#define EVSYS_USER17_CHANNEL_SHIFT		0
#define EVSYS_USER17_CHANNEL_MASK		0x1f
/** @defgroup evsys_user17_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user18 USER18 User Multiplexer n
@{*/


#define EVSYS_USER18_CHANNEL_SHIFT		0
#define EVSYS_USER18_CHANNEL_MASK		0x1f
/** @defgroup evsys_user18_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user19 USER19 User Multiplexer n
@{*/


#define EVSYS_USER19_CHANNEL_SHIFT		0
#define EVSYS_USER19_CHANNEL_MASK		0x1f
/** @defgroup evsys_user19_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user20 USER20 User Multiplexer n
@{*/


#define EVSYS_USER20_CHANNEL_SHIFT		0
#define EVSYS_USER20_CHANNEL_MASK		0x1f
/** @defgroup evsys_user20_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user21 USER21 User Multiplexer n
@{*/


#define EVSYS_USER21_CHANNEL_SHIFT		0
#define EVSYS_USER21_CHANNEL_MASK		0x1f
/** @defgroup evsys_user21_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user22 USER22 User Multiplexer n
@{*/


#define EVSYS_USER22_CHANNEL_SHIFT		0
#define EVSYS_USER22_CHANNEL_MASK		0x1f
/** @defgroup evsys_user22_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user23 USER23 User Multiplexer n
@{*/


#define EVSYS_USER23_CHANNEL_SHIFT		0
#define EVSYS_USER23_CHANNEL_MASK		0x1f
/** @defgroup evsys_user23_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user24 USER24 User Multiplexer n
@{*/


#define EVSYS_USER24_CHANNEL_SHIFT		0
#define EVSYS_USER24_CHANNEL_MASK		0x1f
/** @defgroup evsys_user24_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user25 USER25 User Multiplexer n
@{*/


#define EVSYS_USER25_CHANNEL_SHIFT		0
#define EVSYS_USER25_CHANNEL_MASK		0x1f
/** @defgroup evsys_user25_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user26 USER26 User Multiplexer n
@{*/


#define EVSYS_USER26_CHANNEL_SHIFT		0
#define EVSYS_USER26_CHANNEL_MASK		0x1f
/** @defgroup evsys_user26_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user27 USER27 User Multiplexer n
@{*/


#define EVSYS_USER27_CHANNEL_SHIFT		0
#define EVSYS_USER27_CHANNEL_MASK		0x1f
/** @defgroup evsys_user27_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user28 USER28 User Multiplexer n
@{*/


#define EVSYS_USER28_CHANNEL_SHIFT		0
#define EVSYS_USER28_CHANNEL_MASK		0x1f
/** @defgroup evsys_user28_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user29 USER29 User Multiplexer n
@{*/


#define EVSYS_USER29_CHANNEL_SHIFT		0
#define EVSYS_USER29_CHANNEL_MASK		0x1f
/** @defgroup evsys_user29_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user30 USER30 User Multiplexer n
@{*/


#define EVSYS_USER30_CHANNEL_SHIFT		0
#define EVSYS_USER30_CHANNEL_MASK		0x1f
/** @defgroup evsys_user30_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user31 USER31 User Multiplexer n
@{*/


#define EVSYS_USER31_CHANNEL_SHIFT		0
#define EVSYS_USER31_CHANNEL_MASK		0x1f
/** @defgroup evsys_user31_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user32 USER32 User Multiplexer n
@{*/


#define EVSYS_USER32_CHANNEL_SHIFT		0
#define EVSYS_USER32_CHANNEL_MASK		0x1f
/** @defgroup evsys_user32_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user33 USER33 User Multiplexer n
@{*/


#define EVSYS_USER33_CHANNEL_SHIFT		0
#define EVSYS_USER33_CHANNEL_MASK		0x1f
/** @defgroup evsys_user33_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user34 USER34 User Multiplexer n
@{*/


#define EVSYS_USER34_CHANNEL_SHIFT		0
#define EVSYS_USER34_CHANNEL_MASK		0x1f
/** @defgroup evsys_user34_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user35 USER35 User Multiplexer n
@{*/


#define EVSYS_USER35_CHANNEL_SHIFT		0
#define EVSYS_USER35_CHANNEL_MASK		0x1f
/** @defgroup evsys_user35_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user36 USER36 User Multiplexer n
@{*/


#define EVSYS_USER36_CHANNEL_SHIFT		0
#define EVSYS_USER36_CHANNEL_MASK		0x1f
/** @defgroup evsys_user36_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user37 USER37 User Multiplexer n
@{*/


#define EVSYS_USER37_CHANNEL_SHIFT		0
#define EVSYS_USER37_CHANNEL_MASK		0x1f
/** @defgroup evsys_user37_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user38 USER38 User Multiplexer n
@{*/


#define EVSYS_USER38_CHANNEL_SHIFT		0
#define EVSYS_USER38_CHANNEL_MASK		0x1f
/** @defgroup evsys_user38_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user39 USER39 User Multiplexer n
@{*/


#define EVSYS_USER39_CHANNEL_SHIFT		0
#define EVSYS_USER39_CHANNEL_MASK		0x1f
/** @defgroup evsys_user39_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user40 USER40 User Multiplexer n
@{*/


#define EVSYS_USER40_CHANNEL_SHIFT		0
#define EVSYS_USER40_CHANNEL_MASK		0x1f
/** @defgroup evsys_user40_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user41 USER41 User Multiplexer n
@{*/


#define EVSYS_USER41_CHANNEL_SHIFT		0
#define EVSYS_USER41_CHANNEL_MASK		0x1f
/** @defgroup evsys_user41_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user42 USER42 User Multiplexer n
@{*/


#define EVSYS_USER42_CHANNEL_SHIFT		0
#define EVSYS_USER42_CHANNEL_MASK		0x1f
/** @defgroup evsys_user42_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user43 USER43 User Multiplexer n
@{*/


#define EVSYS_USER43_CHANNEL_SHIFT		0
#define EVSYS_USER43_CHANNEL_MASK		0x1f
/** @defgroup evsys_user43_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup evsys_user44 USER44 User Multiplexer n
@{*/


#define EVSYS_USER44_CHANNEL_SHIFT		0
#define EVSYS_USER44_CHANNEL_MASK		0x1f
/** @defgroup evsys_user44_channel CHANNEL Channel Event Selection
@{*/
/**@}*/


/**@}*/
